from JoKeRUB import l313l
from ..core.managers import edit_or_reply


plugin_category = "بصمات البنات"

@l313l.ar_cmd(
    pattern="(بصمات1)$",
    command=("بصمات1", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 1",
        "الاستـخـدام": "{tr}بصمات1",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.هلا`  `.شلخبار`  `.شلونك`  `.شلونج`  `.نتعرف`  `.اني معجبه`  `.عجبني اراسلك`  `.نرتبط`  `.نتزوج`  `.ترا حبيتك`
`.هلكد ثكيل`  `.دز رصيد`  `.غنيله`  `.اريد رصيد`  `.ارشقلي`  `.ارشق قناتي`  `.ارشقلي حسابي`  `.سويلي تمويل`
`.دز صورتك`  `.دز ببجي`  `.دز لودو`  `.حساب انستا`  `.حساب تيك`  `.الو`  `.وينك`  `.وينج`  `.اي`  `.لا`
`.اكل خره`  `.اكلي خره`  `.يله`  `.شبيك`  `.شبيج`  `.احبج`  `.احبك`  `.تحبني`  `.انطي بوسه`  `.ابوسك`
`.احضنك`  `.اريدك بس الي`  `.ماكدر تصال`  `.ماحب لتصال`
╰───────⌯───────╯
        """
    )

@l313l.ar_cmd(
    pattern="(بصمات2)$",
    command=("بصمات2", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 2",
        "الاستـخـدام": "{tr}بصمات2",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.هاي احسن`  `.يلا لتلح`  `.لا تلحين`  `.امداك`  `.امداج`  `.تمام`  `.هلو محمد`  `.باي`  `.مابيه شي`
`.شنو`  `.كول`  `.اكلج`  `.كولي`  `.مبي شحن`  `.من بغداد`  `.من الكوت`  `.من لعماره`  `.من الناصريه`  `.من البصره`
`.من الديوانيه`  `.من الحله`  `.من السماوه`  `.من كربلاء`  `.من النجف`  `.من دبالى`  `.من صلاح الدين`  `.من كركوك`
`.من الموصل`  `.من سليمانيه`  `.من دهوك`  `.من اربيل`  `.فعلي مميز`  `.بوسهه`  `.دز شدات`  `.عرفني عليك`
`.وانته`  `.ها`  `.شتريد`  `.اني بنيه`  `.اني بنيه لج`  `.17`  `.18`  `.20`  `.21`  `.22`
╰───────⌯───────╯
        """
    )

@l313l.ar_cmd(
    pattern="(بصمات3)$",
    command=("بصمات3", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 3",
        "الاستـخـدام": "{tr}بصمات3",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.ثقفو`  `.جبتك لحاله`  `.ارجع للمطبخ`  `.شلونكم`  `.ليش`  `.تعذرني`  `.لا شكرا`  `.باي حبيبي`  `.غير مره`
`.اكره ليرد متاخر`  `.اكلك`  `.عزه العزاك`  `.جنك ماعاجبك`  `.شكد سخيف`  `.انت مطي`  `.شكد تحمه`  `.شكد فكر`
`.شكد لطير`  `.شكد فاهي`  `.شكد غبي`  `.شنو اسمج`  `.شكرا`  `.هلو كرار`  `.امحح`  `.كافي`  `.ماتاكل خره`
`.ايع`  `.وي`  `.انجب`  `.فهمت لو لا`  `.عادي`  `.امحححح`  `.هلو ابراهيم`  `.هلو حيدر`  `.هلو رضا`
`.هلو مرتضى`  `.هلو عمر`  `.اخوي جفت`  `.والله تمام`
╰───────⌯───────╯
        """
    )

@l313l.ar_cmd(
    pattern="(بصمات4)$",
    command=("بصمات4", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 4",
        "الاستـخـدام": "{tr}بصمات4",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.بخير تمام`  `.الو السلام`  `.انته طيري`  `.وسام احبك`  `.هلو سجاد`  `.هلو باقر`  `.هلو زيد`  `.شدتسوي`
`.ليش زعلت`  `.شكد عمرك`  `.شكد تحبني`  `.ضفي النيه`  `.ضحكه`  `.شتريد يسولفون`  `.بنيه تره`  `.لتصير تافه`
`.هلو عبد`  `.هلو علي`  `.هلو حسون`  `.هلو حسين`  `.هلو مصطفى`  `.هلو احمد`  `.شوف اغار`  `.اغار عليك`  `.غزل`
`.وصخ`  `.دي`  `.اتسرسح`  `.تحبيني`  `.اموت عليك`  `.ماريد اغلط`  `.ماريد اهينك`  `.ماريد اهينج`
╰───────⌯───────╯
        """
    )

@l313l.ar_cmd(
    pattern="(بصمات5)$",
    command=("بصمات5", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 5",
        "الاستـخـدام": "{tr}بصمات5",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.انجب`  `.انجبي`  `.انت المالك`  `.ارفعني`  `.تصبحون على خير`  `.اجت فكره`  `.تموت عل بنات`  `.هلو مسلم`
`.السلام`  `.ممكن نتعرف`  `.هاي انته`  `.من وين`  `.اشكد عمرك`  `.انت مرتبط`  `.من امت مرتبط`  `.ها كبينه`
`.وين مختفي`  `.اكعد راحه`  `.بعدني احبك`  `.عيوني الك`  `.كافي بطل`  `.مو كد كلامك`  `.حبيتك هواي`
`.صارلي احبك`  `.راح احذفك`  `.انته ميت`  `.ليش تغيرت`  `.ذبتني`  `.كلتلك احبك`  `.لا تخليني`
`.رد عل خاص`  `.لاتشوف غيري`  `.كلشي من وراك`  `.انته حظي`  `.هواي تعبت`
╰───────⌯───────╯
        """
    )




@l313l.ar_cmd(
    pattern="(بصمات7)$",
    command=("بصمات7", plugin_category),
    info={
        "header": "لعرض بصمات بنات السورس - الجزء السابع",
        "الاستـخـدام": "{tr}بصمات7",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس - الجزء 7 ⌯ ──╮

`.تشرفت` •  
`.ببا منطقه` •  
`.مرتبط` •  
`.ما مرتبطه` •  
`.ولا مره` •  
`.كم مره حبيت` •  
`.نت ماعندي` •  
`.اطلب` •  
`.رشق انستا` •  
`.انت تحبني` •  
`.اني احبك` •  
`.كم اخ عندك` •  
`.وحيده لهلي` •  
`.مخنوكه` •  
`.بيت عمي` •  
`.بيت خالتي` •  
`.بيت عمتي` •  
`.رايحه للطبيب` •  
`.عادي نرتبط` •  
`.شوي وجي` •  
`.يلا اجيت` •  
`.اخمطج` •  
`.اني حساسه` •  
`.متغيير عليه` •  
`.كيفك حبيبي` •  
`.هلا بروحي` •  
`.هلو شلونك` •  
`.صور خاصك` •  
`.سلم على امك` •  
`.شنو مصدك` •  
`.رفعني` •  
`.مالك5` •  
`.وكت ليعجبني ادز` •  
`.اني اتصل` •  
`.رتبه` •  
`.غزل7` •  
`.ها دوده` •  
`.كس امك` •  
`.تنيجين` •  
`.تنيج` •  
`.كس امج` •  
`.دي فرخ` •  
`.كحبه` •  
`.ابلع بلوك` •  
`.انت الحب` •  
`.انت الاول` •  
`.وين وصلت` •  
`.ابد لتحاول` •  
`.انت تدبرها` •  
`.انت قافل` •  
`.اعشقك` •  
`.اسفا` •  
`.اريد اشوفك` •  
`.ليش مصدك` •  
`.غنيلي` •  
`.كوه دزيت` •  
`.حروح اسبح` •  
`.اشكرك` •  
`.نورت` •  
`.مافهم عليج` •  
`.جهز رصيدك` •  
`.جيب رصيد` •  
`.العفو كلبي` •  
`.اريد اروح` •  
`.انجب2` •  
`.انجبي2` •

╰───────⌯───────╯
        """
    )




@l313l.ar_cmd(
    pattern="(بصمات6)$",
    command=("بصمات6", plugin_category),
    info={
        "header": "لعرض بصمات بنات السورس - الجزء السادس",
        "الاستـخـدام": "{tr}بصمات6",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس - الجزء 6 ⌯ ──╮

`.ليش مامرتبط` •  
`.نصير اصدقاء` •  
`.تشرفت` •  
`.لحضه` •  
`.مشغول` •  
`.مترد بسرعه` •  
`.الجو حار` •  
`.شخبارك` •  
`.تابع مردوده` •  
`.اسمي ايه` •  
`.ضحكتني` •  
`.جوعانه` •  
`.امي صاحتني` •  
`.بابا صاحني` •  
`.اريد اتغده` •  
`.هسه كعدو اهلي` •  
`.صباحو` •  
`.سلام عليكم` •  
`.عليكم السلام` •  
`.عليكم السلام تفضلي` •  
`.احبك علي` •  
`.احبك حسين` •  
`.احبك عباس` •  
`.مشتاقتلك` •  
`.نسيتني` •  
`.ليش تحظر` •  
`.احبك اورهان` •  
`.احبك2` •  
`.عبودي` •  
`.ابعت هديه` •  
`.بهاء احبك` •  
`.دز رصيد اونسك` •  
`.فوك ما تعبانه` •  
`.ثقه` •  
`.باي تعبت ممستفاده` •  
`.احبك احمد` •  
`.مشايف حلوين` •  
`.طفي الكامره` •  
`.زلمه جيس` •  
`.انجب لدوخني` •  
`.اخجل اني` •  
`.هذه شنو` •  
`.اتصنع` •  
`.ماعرف شحجي` •  
`.حشوره` •  
`.تحب الاندومي` •  
`.اكوله احبك يكلي شلابسه` •  
`.اوي دروحي` •  
`.كتمتك` •  
`.هاي شبيك` •  
`.لكلاوات` •  
`.هاي ليش` •  
`.هلو شلونك` •  
`.عادي نتعرف` •  
`.ااسلام عليكم` •  
`.شلونك2` •  
`.اني سينكل` •  
`.اني حلوه` •  
`.اهلي يمي` •  
`.مكدر` •  
`.اهلي ميعرفون` •  
`.يله تنام` •  
`.من وين` •  
`.شسمك` •  
`.شسمك2` •  
`.شسمج2` •  

╰───────⌯───────╯
        """
    )


@l313l.ar_cmd(
    pattern="(بصمات9)$",
    command=("بصمات9", plugin_category),
    info={
        "header": "لعرض بصمات بنات السورس - الجزء التاسع",
        "الاستـخـدام": "{tr}بصمات9",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات قط ⌯ ──╮

`.من تحول` •  
`.على شنو` •  
`.هلا تفضل` •  
`.هلا شلونك` •  
`.تمام الحمدلله` •  
`.اني شعلي` •  
`.ححول وريحك` •  
`.مواصفات` •  
`.تمامم` •  
`.وين مكانك` •  
`.عمولتي10` •  
`.اه مشتهيه` •  
`.ماعندك ثقه` •  
`.مو بكيفك` •  
`.جاد لو لا` •  
`.للثقه` •  
`.لاحضرتك` •  
`.مالتي وردي` •  
`.اخابر وجي` •  
`.كل لمحافضات` •  
`.اني بنت` •  
`.تبياته لو ساعات` •  
`.كام10 صوت5` •  
`.سعر تبياته` •  
`.سعر ساعه` •  
`.مكان` •  
`.اعمار` •

╰───────⌯───────╯
        """
    )

@l313l.ar_cmd(
    pattern="(بصمات8)$",
    command=("بصمات8", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 8",
        "الاستـخـدام": "{tr}بصمات6",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.مرتبط2`  `.لويش مامرتبط`  `.لحضه2`  `.عومري`  `.احبك2`  `.تفاعل قليل`  `.احبج2`  `.اموت بيك`
`.اموت بيج`  `.حياتي2`  `.رويحتي`  `.شلونك2`  `.شلونج2`  `.شخباركم2`  `.بخير اذا انت`  `.شكو ماكو`
`.بيش`  `.بصره`  `.بغداد`  `.ديالى`  `.لحله`  `.اربيل`  `.كوت`  `.سامراء`  `.كوت2`
`.نورتي2`  `.حياك`  `.حياج`  `.مقدمه`  `.نهايه`  `.صباحو2`  `.هلاة يروحي2`  `.هلا قلبي2`
`.بربوك`  `.ابلع بلوك2`  `.شعر1`  `.شعر2`  `.امشي لك`  `.ابو لبنات`  `.ايع2`  `.مشاعرك عضروطيه`
`.س نشر`  `.س حمايه`  `.اريد هديه`  `.اريد نجوم`  `.50 نجمه`  `.100 نجمه`  `.ماعندي نجوم`  `.25 نجمه`
`.شلخبار2`  `.شلونك3`  `.شلونج3`  `.نتعرف2`  `.معجبه`  `.عجبني اراسلك`  `.نزوج2`  `.ترا حبيتك`
`.سويلي تمويل`  `.ارشق قناتي`  `.ارشقلي`  `.غنيلي2`  `.غنيلك`  `.ارشق حسابي`  `.دز رصيد2`
`.شبيك لك`  `.ماكدر تصال2`  `.ماحب لتصال`  `.ابوسك2`  `.الو2`  `.اني بنيه لك`  `.اني بنيه لج`
`.مبي شحن2`  `.يلا لتلحين2`  `.مادري2`  `.فعلي مميز2`  `.همداك`  `.شدلي منصه2`  `.بيش هاذ`
`.قفل`  `.متتوفر`  `.الو السلام2`  `.شكد فاهي2`  `.شدسوي2`  `.هاي انته2`  `.اني حلوه2`
╰───────⌯───────╯
        """
    )
@l313l.ar_cmd(
    pattern="(بصمات10)$",
    command=("بصمات10", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 10",
        "الاستـخـدام": "{tr}بصمات7",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.رفعني2`  `.ليش2`  `.تعذرني`  `.لا شكرا2`  `.ثقفو2`  `.عزه لعزاك`  `.ليش تغييرت`  `.اكل خره2`
`.اخوي اجهه`  `.هلو كرار2`  `.هلو محمد2`  `.هلو`
╰───────⌯───────╯
        """
    )

@l313l.ar_cmd(
    pattern="(بصمات11)$",
    command=("بصمات11", plugin_category),
    info={
        "header": "بصمات بنات السورس - الجزء 11",
        "الاستـخـدام": "{tr}بصمات8",
    },
)
async def _(event):
    await edit_or_reply(
        event,
        """
╭── ⌯ بصمات بنات السورس ⌯ ──╮
`.هلو داده`  `.عيوني الك`  `.شكد عمرك2`  `.من شوكت مرتبط`  `.راح احذفك`  `.رد خاص`
`.كلشي من وراك`  `.غيري لاشوف`  `.هواي تعبت`  `.هلو حسون2`  `.هلو عبودي2`  `.هلو مصطفى2`  `.وصخ2`
╰───────⌯───────╯
        """
    )